print("\033c")
# print(dir(list))

# Встановити python і pycharm 
print("Dom01_01 =", "+")

# Створити новий проект для домашніх робіт
print("Dom01_02 =", "+",)

# Знайти остачу від ділення 121 на 12, і скільки націло поділиться 134 на 7
a1 = 121
b1 = 12
a2 = 134
b2 = 7

c1 = a1 % b1
# c1 = a1 / b1
# d1 = int(c1)
# e1 = b1 * d1
# c1 = a1 - e1

e2 = a2 // b2 
# c2 = a2 / b2
# e2 = int(c2)

print("Dom01_03 =",c1, "i", e2)

# Обчислити 2 ^ 10
a = 2
# ^ = **
b = 10

c = a ** b
print("Dom01_04 =", c)

# Створити список з 12 елементів
a = 12
b = [1] * a

print("Dom01_05 =", b)


# Добавити в середину списку новий елемент зі значенням 56 ( середина має обчислюватися автоматично )

a = [1, 2, 3, 4, 5]
b = [56]
avr = len(a) // 2 #+ 1
a = a[0:avr] + b + a[avr:]

# b = 56
# avr = len(a) / 2
# avr2 = int(avr)
# a.insert(avr2, b)       #Но так тоже работает

print("Dom01_06 =", a)

# Обновити 4й елемент до 25
a = [1, 2, 3, 4, 5, 6, 7]
f = 4
b = 25
a[f-1] = b

# a.remove(f)
# a.insert(f - 1, b)

print("Dom01_07 =", a)

# Додати в кінець списку 88
a = []
a = [1] * 5
c = 88
a.append(c)

print("Dom01_08 =", a)

# Видалити перший елемент списку
a = [1, 2, 3, 4, 5]
del a[0]

print("Dom01_09 =", a)

# Видалити остатній елемент списку і вивести в консоль його значення
a = [1, 2, 3, 4, 5, 6, 7]
b = a.pop(-1)

print("Dom01_10 =", b)